Revit 2026 API

# WireMaterialTypeSet Constructor

---

Initializes a new instance of the WireMaterialTypeSet class

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireMaterialTypeSet()
```
```vb
Public Sub New
```
```cpp
public:
WireMaterialTypeSet()
```
```fsharp
new : unit -> WireMaterialTypeSet
```

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace